In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:\\Users\\raths\\Downloads\\placement - placement.csv")

In [3]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [4]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [5]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [10]:
top_left_corner_df = df.iloc[:5,:3]
top_left_corner_df

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [13]:
s = df.axes #no. of rows
s

[RangeIndex(start=0, stop=100, step=1),
 Index(['cgpa', 'resume_score', 'placed'], dtype='object')]

In [15]:
b = df.empty #find the missing value it return true otherwise false
b

False

In [16]:
i = df.ndim  #diminsion
i

2

In [17]:
t = df.shape #shape = n(rows)*n(columns)
t

(100, 3)

In [18]:
d = df.size #row count * column count
d

300

In [20]:
a = df.values # get a numpy array for df

In [21]:
df = df.copy()

In [23]:
p = df.sort_values(by = 'resume_score')
p

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [25]:
r = df.sort_index()
r

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [28]:
# x = df.astype(int) #type conversion
x = df['cgpa'].astype(int)
x

0     8
1     6
2     8
3     6
4     7
     ..
95    6
96    8
97    6
98    8
99    6
Name: cgpa, Length: 100, dtype: int32

In [31]:
t = df.abs()
t

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [33]:
t = df.add(4)
t

     cgpa  resume_score  placed
0   12.14         10.52       5
1   10.17          9.17       4
2   12.27         12.86       5
3   10.88         11.27       5
4   11.52         11.30       5
..    ...           ...     ...
95  10.33         10.38       4
96  12.23         11.76       5
97  10.65         11.78       4
98  12.14          9.63       5
99  10.09         10.61       4

[100 rows x 3 columns]

In [35]:
s = df.count()
s

cgpa            100
resume_score    100
placed          100
dtype: int64

In [37]:
p = df.max()
p

cgpa            9.40
resume_score    9.06
placed          1.00
dtype: float64

In [38]:
q = df.min()
q

cgpa            5.27
resume_score    4.95
placed          0.00
dtype: float64

In [40]:
s = df.median()
s

cgpa            6.620
resume_score    7.055
placed          0.500
dtype: float64

In [42]:
s = df.sum()
s

cgpa            694.22
resume_score    693.05
placed           50.00
dtype: float64

In [44]:
g = df.filter(items = ['cgpa','placed'])
g

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [45]:
df[['cgpa','placed']]

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [47]:
s = df.filter(items = [5,6], axis = 0) #0 = row basis and 1 = column basis
s

   cgpa  resume_score  placed
5  8.77          6.19       1
6  5.34          7.09       0

In [49]:
t = df.filter(like = '5')
t

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

[100 rows x 0 columns]

In [52]:
s = df.to_dict() #save in dictionary

In [53]:
q = df.to_string() # to save in string

In [54]:
idx = df.columns

In [55]:
label = df.columns[0] #first column label
label

'cgpa'

In [57]:
p = df.columns.tolist() # list of columns
p

['cgpa', 'resume_score', 'placed']

In [59]:
q = df.columns.values #array of columns label 
q

array(['cgpa', 'resume_score', 'placed'], dtype=object)

In [60]:
p = df.rename(columns = {'cgpa':'half_yearly_marks', 'resume_score': 'semester_marks'})
p

    half_yearly_marks  semester_marks  placed
0                8.14            6.52       1
1                6.17            5.17       0
2                8.27            8.86       1
3                6.88            7.27       1
4                7.52            7.30       1
..                ...             ...     ...
95               6.33            6.38       0
96               8.23            7.76       1
97               6.65            7.78       0
98               8.14            5.63       1
99               6.09            6.61       0

[100 rows x 3 columns]

In [62]:
df['half'] = df['cgpa'].where(df['cgpa']>8, other = 0)
df.head(10)

   cgpa  resume_score  placed  half
0  8.14          6.52       1  8.14
1  6.17          5.17       0  0.00
2  8.27          8.86       1  8.27
3  6.88          7.27       1  0.00
4  7.52          7.30       1  0.00
5  8.77          6.19       1  8.77
6  5.34          7.09       0  0.00
7  6.56          6.29       0  0.00
8  6.32          6.71       0  0.00
9  7.69          7.12       1  0.00